Coding/Cpp/const-static.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>const、static、const staic理解</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="const、static、const staic理解"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:03:20 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">const、static、const staic理解</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 static的理解</a></li>
<li><a href="#sec-2">2 const 新自定义类型 p; 则p不可变</a></li>
<li><a href="#sec-3">3 不可重入函数</a></li>
<li><a href="#sec-4">4 类的static成员变量</a></li>
<li><a href="#sec-5">5 类的const成员变量</a></li>
<li><a href="#sec-6">6 类的static const成员变量</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> static的理解</h2>
<div class="outline-text-2" id="text-1">

<dl>
<dt>理解</dt><dd>
<ol>
<li>变量被存储在全局存储区里，可以下次调用的时候仍旧保持原来的值，这是与堆栈变量的区别。<br/>
</li>
<li>变量前static告知编译器，此变量仅在变量的作用范围内有效，这是与全局变量的区别。<br/>
</li>
</ol>

</dd>
<dt>一个选择题</dt><dd>
</dd>
</dl>

<p>关于static变量，请选择下面所有说法正确的内容： <br/>
</p><ol>
<li>若全局变量仅在单个C文件中访问，则可以将这个变量修改为静态全局变量，以降低模块间的耦合度； <br/>
</li>
<li>若全局变量仅由单个函数访问，则可以将这个变量改为该函数的静态局部变量，以降低模块间的耦合度； <br/>
</li>
<li>设计和使用访问动态全局变量、静态全局变量、静态局部变量的函数时，需要考虑重入问题； <br/>
</li>
<li>静态全局变量过大，可那会导致堆栈溢出。 <br/>
</li>
<li>
</li>
</ol>

<p>对于A，B：根据本篇概述部分的说明b)，我们知道，A,B都是正确的。 <br/>
对于C：根据本篇概述部分的说明a)，我们知道，C是正确的（所谓的函数重入问题，下面会详细阐述）。 <br/>
对于D：静态变量放在程序的全局数据区，而不是在堆栈中分配，所以不可能导致堆栈溢出，D是错误的。 <br/>
因此，答案是A、B、C。 <br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> const 新自定义类型 p; 则p不可变</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-c++"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #a020f0;">using</span> <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">std</span>;
<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">char</span>* <span style="color: #228b22;">pchar</span>;
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">str</span>[10] = <span style="color: #8b2252;">"abcdef"</span>;
        <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">p1</span> = str;
        <span style="color: #a020f0;">const</span> <span style="color: #228b22;">pchar</span> <span style="color: #a0522d;">p2</span> = str;
        p1++;
        p2++;
        <span style="color: #a020f0;">return</span> 0;
}
</pre>

<dl>
<dt>上面程序出错的原因</dt><dd>
</dd>
</dl>

<p>const char* p1 = str; 其中p1是可变指针指向不可变的字符串。所以p1++正确。<br/>
typedef char* pchar; 定义了一种新类型，所以 const pchar p2; p2是const类型的，所以p2++出错。<br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 不可重入函数</h2>
<div class="outline-text-2" id="text-3">

<p>所谓可重入函数就是结果可预测（即只要输入数据相同，输出结果就相同）。<br/>
下面的函数就不是可重入函数，因为static的缘故。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #0000ff;">sum_int</span>( <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span>)
{ 
        &#12288;<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> index; 
        &#12288;<span style="color: #a020f0;">static</span> <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> sum = 0; <span style="color: #b22222;">// </span><span style="color: #b22222;">&#27880;&#24847;&#65292;&#26159;static&#31867;&#22411;&#30340;&#12290; </span>
        &#12288;<span style="color: #a020f0;">for</span> (index = 1; index &lt;= base; index++) 
                &#12288;&#12288;sum += index; 
        &#12288;<span style="color: #a020f0;">return</span> sum; 
} 
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 类的static成员变量</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>
{
<span style="color: #a020f0;">public</span>:
    <span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">cnt</span>;
    <span style="color: #0000ff;">A</span>(){cnt++;}
    <span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #0000ff;">how_many_instance</span>(){
        <span style="color: #a020f0;">return</span> cnt;
    }
};
<span style="color: #228b22;">int</span> <span style="color: #008b8b;">A</span>::<span style="color: #a0522d;">cnt</span> = 0;         <span style="color: #b22222;">//</span><span style="color: #b22222;">&#31867;&#30340;static&#25104;&#21592;&#21464;&#37327;&#24517;&#39035;&#22312;&#31867;&#22806;&#21021;&#22987;&#21270;&#65292;&#24182;&#19988;&#22312;&#21152;&#19978;&#20854;&#31867;&#22411;&#21644;&#31867;&#21517;::</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
    cout&lt;&lt;<span style="color: #008b8b;">A</span>::how_many_instance()&lt;&lt;endl;
    <span style="color: #228b22;">A</span> <span style="color: #a0522d;">a</span>, <span style="color: #a0522d;">b</span>, <span style="color: #a0522d;">c</span>, <span style="color: #a0522d;">d</span>;
    cout&lt;&lt;<span style="color: #008b8b;">A</span>::how_many_instance()&lt;&lt;endl;
    <span style="color: #a020f0;">return</span> 0;
}
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 类的const成员变量</h2>
<div class="outline-text-2" id="text-5">

<dl>
<dt>类的const成员变量只能以初始化列表的形式初始化</dt><dd>
</dd>
</dl>




<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>
{
<span style="color: #a020f0;">public</span>:
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>;
    <span style="color: #0000ff;">A</span>(){a=0;}
};
</pre>



<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>
{
<span style="color: #a020f0;">public</span>:
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>;
    <span style="color: #0000ff;">A</span>():a(10){}
};
</pre>


<p>
上面程序第一个报错，因为类的const成员变量只能以初始化列表的形式初始化。<br/>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 类的static const成员变量</h2>
<div class="outline-text-2" id="text-6">

<dl>
<dt>static const变量与static变量初始化方式一样</dt><dd>
</dd>
</dl>




<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>
{
<span style="color: #a020f0;">public</span>:
    <span style="color: #a020f0;">static</span> <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>;
};
<span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #008b8b;">A</span>::<span style="color: #a0522d;">a</span> = 0;
</pre>

<p>
static const变量与static变量初始化方式一样，只是前者在变量名前加上const。<br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
